# Break 1:

Exercise: Create a dataframe that contains the information about an hypothetical list of christmas presents you made 

Exercise: Create a dataframe with 1000 rows, columns "Gender" and "Height", exactly 500 males and 500 females, such that female's height average is roughly 168, and male's roughly 174

In [2]:
import pandas as pd
import random

# Creiamo una lista di regali ipotetici
regali = [
    'Smartphone', 'Tablet', 'Laptop', 'Giocattolo', 'Vestito', 'Bicicletta', 'Cuffie', 
    'Libro', 'Gioco da tavolo', 'Peluche', 'Borsa', 'Orologio', 'Zaino', 'Pantaloni', 'Sciarpa'
]

categorie = ['Elettronica', 'Giocattolo', 'Abbigliamento', 'Sport', 'Accessori']
destinatari = ['Mamma', 'Pap√†', 'Fratello', 'Sorella', 'Amico', 'Amica', 'Nonno', 'Nonna', 'Cugino', 'Cugina']

# Creiamo una lista di prezzi casuali
prezzi = [random.randint(10, 1000) for _ in range(100)]

# Creiamo il DataFrame
df_regali = pd.DataFrame({
    'Regalo': [random.choice(regali) for _ in range(100)],
    'Categoria': [random.choice(categorie) for _ in range(100)],
    'Destinatario': [random.choice(destinatari) for _ in range(100)],
    'Prezzo': prezzi
})

# Visualizza le prime righe del DataFrame
df_regali.head()

      Regalo   Categoria Destinatario  Prezzo
0   Orologio       Sport       Cugino     591
1  Pantaloni       Sport       Cugina     803
2     Tablet  Giocattolo       Cugina     448
3     Tablet       Sport       Cugina      76
4     Tablet       Sport        Nonno      73

Il parametro loc in `np.random.normal(loc=0, scale=5, size=5)` rappresenta la media (o valore centrale) della distribuzione normale da cui vengono generati i numeri casuali.

In [6]:
import pandas as pd
import numpy as np

# Parametri
n_males = 500
n_females = 500
male_avg_height = 174
female_avg_height = 168

# Genera altezze per maschi e femmine separatamente
male_heights = np.random.normal(male_avg_height, 10, n_males)
female_heights = np.random.normal(female_avg_height, 10, n_females)

# Crea il DataFrame
df = pd.DataFrame({
    'Gender': ['Male'] * n_males + ['Female'] * n_females,
    'Height': list(male_heights) + list(female_heights)  # Combina direttamente le due liste
})

# Visualizza le prime righe
print(df.head())

# Verifica l'altezza media per ciascun genere
df.groupby('Gender')['Height'].mean()

  Gender      Height
0   Male  167.751344
1   Male  175.436918
2   Male  174.395240
3   Male  179.804779
4   Male  168.920650

Gender
Female    167.950689
Male      173.945882
Name: Height, dtype: float64

# Break 2:

Exercise: Use the Titanic dataframe to calculate the average Age in each Pclass

Exercise: Use the Titanic dataframe to calculate the number of survived that are named John

In [10]:
df2 = pd.read_csv('data/titanic.csv')
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
age_class = df2.groupby('Pclass')['Age'].mean()
print(age_class)

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [23]:
# Filtra i passeggeri il cui primo nome √® esattamente "John" (ignorando titoli e cognomi)
john_passengers = df2[df2['Name'].str.extract(r'(\bJohn\b)')[0] == 'John']

# Conta quanti passeggeri si chiamano esattamente "John"
john_count = john_passengers.shape[0]

# Visualizza il risultato
print(f"John = {john_count}")

John = 44